/****************************************Copyright (c)****************************************************
**               Copyright © 2003~2009 Shenzhen uCdragon Technology Co.,Ltd. All Rights Reserved 
**
**                                 http://www.ucdragon.com
**
**      ÉîÛÚÊÐÓÅÁú¿Æ¼¼ÓÐÏÞ¹«Ë¾ËùÌá¹©µÄËùÓÐ·þÎñÄÚÈÝÖ¼ÔÚÐ­Öú¿Í»§¼ÓËÙ²úÆ·µÄÑÐ·¢½ø¶È£¬ÔÚ·þÎñ¹ý³ÌÖÐËùÌá¹©
**  µÄÈÎºÎ³ÌÐò¡¢ÎÄµµ¡¢²âÊÔ½á¹û¡¢·½°¸¡¢Ö§³ÖµÈ×ÊÁÏºÍÐÅÏ¢£¬¶¼½ö¹©²Î¿¼£¬¿Í»§ÓÐÈ¨²»Ê¹ÓÃ»ò×ÔÐÐ²Î¿¼ÐÞ¸Ä£¬±¾¹«Ë¾²»
**  Ìá¹©ÈÎºÎµÄÍêÕûÐÔ¡¢¿É¿¿ÐÔµÈ±£Ö¤£¬ÈôÔÚ¿Í»§Ê¹ÓÃ¹ý³ÌÖÐÒòÈÎºÎÔ­ÒòÔì³ÉµÄÌØ±ðµÄ¡¢Å¼È»µÄ»ò¼ä½ÓµÄËðÊ§£¬±¾¹«Ë¾²»
**  ³Ðµ£ÈÎºÎÔðÈÎ¡£
**                                                                        ¡ªÉîÛÚÊÐÓÅÁú¿Æ¼¼ÓÐÏÞ¹«Ë¾
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               MKL_adc.c
** Last modified date:      2012-12-12
** Last version:            V1.0
** Descriptions:            adcÇý¶¯³ÌÐò
**
**--------------------------------------------------------------------------------------------------------
** Created by:              JiaoLong Liu
** Created date:            2012-12-12
** Version:                 V0.9
** Descriptions:            ADC³õÊ¼»¯ ³õÊ¼°æ±¾
**--------------------------------------------------------------------------------------------------------
** Modified by:        
** Modified date:      
** Version:            
** Descriptions:       
**
*********************************************************************************************************/
#include "..\..\App\includes.h"

/*********************************************************************************************************
** Function name:           adcInit
** Descriptions:            adcµÄ³õÊ¼»¯
** input parameters:        none
** output parameters:       none
** Returned value:          none
** Created by:              JiaoLong Liu
** Created date:            2012-12-12
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
*********************************************************************************************************/
void  adcInit (void) 
{
    SIM_SCGC5 |= SIM_SCGC5_PORTE_MASK;                                   /* ¿ªÆôPE GPIOÊ±ÖÓ              */
    PORTE_PCR20 = PORT_PCR_MUX(0);                                       /* ¿ªÆôPE20¹Ü½ÅÄ£Äâ¹¦ÄÜ          */
    SIM_SCGC6 |= SIM_SCGC6_ADC0_MASK;                                   /* ¿ªÆôADCÊ±ÖÓ                  */
    /*
     * ÅäÖÃADCÏà¹Ø¹¦ÄÜ
     */
    ADC0_CFG1 = ADC_CFG1_ADLSMP_MASK | ADC_CFG1_MODE(3) | ADC_CFG1_ADICLK(0);
    ADC0_SC2 |= ADC_SC2_REFSEL(1);                                      /* Ñ¡ÔñµçÔ´²Î¿¼Ô´               */
}

/*********************************************************************************************************
** Function name:           adcGetUint
** Descriptions:            adc¶ÁÈ¡
** input parameters:        none
** output parameters:       adcÊýÖµ
** Returned value:          none
** Created by:              JiaoLong Liu
** Created date:            2012-12-12
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
*********************************************************************************************************/
INT16U  adcGetUint (void) 
{
    ADC0_SC1(0) = ADC_SC1_ADCH(0);                                      /* Ñ¡ÔñADCÐÅµÀ                  */
    while ((ADC0_SC1(0) & ADC_SC1_COCO_MASK) != ADC_SC1_COCO_MASK);     /* µÈ´ý×ª»»Íê³É                 */
    return ADC0_R(0);                                                   /* Êä³ö½á¹û                     */
}

/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/



